# Homebrew repositories
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Third-party repositories
tap "cjbassi/gotop"
tap "jesseduffield/lazydocker"
tap "neovim/neovim"
tap "xo/xo"

# CLI tools
brew "abook"
brew "autojump"
brew "bandwhich"
brew "bat"
brew "calcurse"
brew "cjbassi/gotop/gotop"
brew "exa"
brew "fd"
brew "fswatch"
brew "fzf"
brew "httpie"
brew "jesseduffield/lazydocker/lazydocker"
brew "jq"
brew "lazygit"
brew "lf"
brew "mpc"
brew "mpd", restart_service: true
brew "ncmpcpp"
brew "neofetch"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "node"
brew "p7zip"
brew "postgresql"
brew "procs"
brew "ripgrep"
brew "sl"
brew "stow"
brew "terminal-notifier"
brew "thefuck"
brew "watch"
brew "wget"
brew "xo/xo/usql"
brew "youtube-dl"

# Misc.
cask "alacritty"
cask "chromedriver"
cask "font-jetbrainsmono-nerd-font"
cask "mpv"
